## Terraform `Kubernetes`
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
#### Plan 📖`success`
#### Plan Request Change 📖`success`
#### Apply 📖`success`

<details><summary>Show Details</summary>

```terraform


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.kube.yandex_kubernetes_cluster.kube_cluster has been deleted
  - resource "yandex_kubernetes_cluster" "kube_cluster" {
      - id                       = "catos66dnmadlbd2glcj" -> null
      - name                     = "k8s-cluster-7f46kpjf" -> null
        # (17 unchanged attributes hidden)

      - master {
          - cluster_ca_certificate = <<-EOT
                -----BEGIN CERTIFICATE-----
                MIIC5zCCAc+gAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
                cm5ldGVzMB4XDTI1MDQyMDA5MzczNloXDTM1MDQxODA5MzczNlowFTETMBEGA1UE
                AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAOt0
                KSMjW4STUeF8TBtNjeQHcFvIEhrExtesbcot7KVkPFRjHAGEkB64+r7+etU7uQgI
                5E8dq9CLQk1/zh2VCdKFp5lhTrr7Jeq8DCBa7NNQeeDeBgk49N5c4Ui+UEFzf9La
                tMsEGZQ6nIzTL+656u6yzloJ9AGUbFtvuSoDPi271qqlCfifjf0koq5iYKuv7ccG
                b4v7rkk7D7lRgEzt5LKYuOKs7K1NwZYi+ZNYpEu2y/Alr4ZRI0GEKM54nvkSFsB4
                2X7VQYmnv4SQgWGwoxl3h3jR58VmqBRRrBntt9p1YbGWUnocPuCQP+UwZnt+c4NU
                NE68Z0v30LiBksrZAekCAwEAAaNCMEAwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
                /wQFMAMBAf8wHQYDVR0OBBYEFAetdMKIu3Zpm56I0VJnPogz3nYVMA0GCSqGSIb3
                DQEBCwUAA4IBAQA7DkTw+ErBWhU39Ge7wegadaggPqKg8jCljM7FX6By8Tok9Xc9
                TpGtUENXDg71xpEMxIUGw8kkkYQwesR0BcmhemA4bqk0N+2hBn/RC4znOL5SJReo
                1SfTzqQKS5fjHsvSQ9PI/R+5c8lgFJcuMBmXMooSSwfP1m7s1bCCVJPUPIfE7HSG
                oXIocgVuqyYQglhiOjrFKKvHAoS86AySpt4eAVaWcBcgbykhSeW7jVupoa+Lvu1D
                TnxuVbzhYLf0duewZtfsWU+0ZfTxZlN//SGyHxcdalO+/JxgkQ8cT0q0MG+hBOxt
                rrw4j0jyAKFkvuy7EbdRpyGEpmZWemOHL3LN
                -----END CERTIFICATE-----
            EOT -> null
          - external_v4_address    = "158.160.89.162" -> null
          - external_v4_endpoint   = "https://158.160.89.162" -> null
          - internal_v4_address    = "10.10.0.34" -> null
          - internal_v4_endpoint   = "https://10.10.0.34" -> null
            # (7 unchanged attributes hidden)

            # (4 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube.yandex_kubernetes_cluster.kube_cluster will be created
  + resource "yandex_kubernetes_cluster" "kube_cluster" {
      + cluster_ipv4_range       = "172.17.0.0/16"
      + cluster_ipv6_range       = (known after apply)
      + created_at               = (known after apply)
      + description              = "Yandex Managed K8S cluster"
      + folder_id                = "b1gsjjo950i2c5fs82pe"
      + health                   = (known after apply)
      + id                       = (known after apply)
      + labels                   = (known after apply)
      + log_group_id             = (known after apply)
      + name                     = "k8s-cluster-7f46kpjf"
      + network_id               = "enpfvstgrpql3nm9ljha"
      + network_policy_provider  = "CALICO"
      + node_ipv4_cidr_mask_size = 24
      + node_service_account_id  = "aje7n2bce7r1d3hunl0p"
      + release_channel          = "REGULAR"
      + service_account_id       = "ajea8pbj4f601i56sm5u"
      + service_ipv4_range       = "172.18.0.0/16"
      + service_ipv6_range       = (known after apply)
      + status                   = (known after apply)

      + kms_provider {
          + key_id = "abjes6v5635sq3hrssui"
        }

      + master {
          + cluster_ca_certificate = (known after apply)
          + etcd_cluster_size      = (known after apply)
          + external_v4_address    = (known after apply)
          + external_v4_endpoint   = (known after apply)
          + external_v6_endpoint   = (known after apply)
          + internal_v4_address    = (known after apply)
          + internal_v4_endpoint   = (known after apply)
          + public_ip              = true
          + security_group_ids     = [
              + "enphhr50vgv3q3d6cu4t",
              + "enpmmfsa3fghjuaq0fi7",
            ]
          + version                = (known after apply)
          + version_info           = (known after apply)

          + maintenance_policy {
              + auto_upgrade = true

              + maintenance_window {
                  + day        = "monday"
                  + duration   = "3h"
                  + start_time = "23:00"
                }
            }

          + master_location {
              + subnet_id = "e2lgfldqt2831li63a77"
              + zone      = "ru-central1-b"
            }

          + master_logging {
              + audit_enabled              = true
              + cluster_autoscaler_enabled = true
              + enabled                    = true
              + events_enabled             = true
              + folder_id                  = "b1gsjjo950i2c5fs82pe"
              + kube_apiserver_enabled     = true
            }

          + regional (known after apply)

          + zonal (known after apply)
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }
    }

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 01"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-01"
      + node_labels       = {
          + "environment" = "testing"
          + "role"        = "worker-01"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy (known after apply)

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = [
                  + "enp4nj9j4iin76n4t30v",
                  + "enphhr50vgv3q3d6cu4t",
                ]
              + subnet_ids         = [
                  + "e2lgfldqt2831li63a77",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 02"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-02"
      + node_labels       = {
          + "environment" = "dev"
          + "role"        = "worker-02"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy {
          + max_expansion   = 1
          + max_unavailable = 1
        }

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = [
                  + "enp4nj9j4iin76n4t30v",
                  + "enphhr50vgv3q3d6cu4t",
                ]
              + subnet_ids         = [
                  + "e2lgfldqt2831li63a77",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + auto_scale {
              + initial = 0
              + max     = 1
              + min     = 0
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_id             = "catos66dnmadlbd2glcj" -> (known after apply)
  ~ external_v4_endpoint   = (sensitive value)

data.terraform_remote_state.vpc: Reading...
module.kube.random_string.unique_id: Refreshing state... [id=7f46kpjf]
module.kube.data.yandex_client_config.client: Reading...
module.kube.data.yandex_client_config.client: Read complete after 0s [id=3165309435]
module.kube.yandex_iam_service_account.master[0]: Refreshing state... [id=ajea8pbj4f601i56sm5u]
module.kube.yandex_iam_service_account.node_account[0]: Refreshing state... [id=aje7n2bce7r1d3hunl0p]
module.kube.yandex_kms_symmetric_key.kms_key[0]: Refreshing state... [id=abjes6v5635sq3hrssui]
data.terraform_remote_state.vpc: Read complete after 0s
module.kube.yandex_vpc_security_group.k8s_nodes: Refreshing state... [id=enp4nj9j4iin76n4t30v]
module.kube.yandex_vpc_security_group.k8s_master_whitelist_sg[0]: Refreshing state... [id=enpmmfsa3fghjuaq0fi7]
module.kube.yandex_vpc_security_group.k8s_main_sg[0]: Refreshing state... [id=enphhr50vgv3q3d6cu4t]
module.kube.yandex_resourcemanager_folder_iam_member.sa_logging_writer_role[0]: Refreshing state... [id=b1gsjjo950i2c5fs82pe/logging.writer/serviceAccount:ajea8pbj4f601i56sm5u]
module.kube.yandex_resourcemanager_folder_iam_member.sa_public_loadbalancers_role[0]: Refreshing state... [id=b1gsjjo950i2c5fs82pe/load-balancer.admin/serviceAccount:ajea8pbj4f601i56sm5u]
module.kube.yandex_resourcemanager_folder_iam_member.sa_calico_network_policy_role[0]: Refreshing state... [id=b1gsjjo950i2c5fs82pe/k8s.clusters.agent/serviceAccount:ajea8pbj4f601i56sm5u]
module.kube.yandex_kms_symmetric_key_iam_binding.encrypter_decrypter[0]: Refreshing state... [id=abjes6v5635sq3hrssui/kms.keys.encrypterDecrypter]
module.kube.yandex_resourcemanager_folder_iam_member.node_account[0]: Refreshing state... [id=b1gsjjo950i2c5fs82pe/container-registry.images.puller/serviceAccount:aje7n2bce7r1d3hunl0p]
module.kube.yandex_vpc_security_group_rule.k8s_node_ssh_access_rule[0]: Refreshing state... [id=enpmt76mpaqqpnmjmd1v]
module.kube.yandex_vpc_security_group_rule.k8s_outgoing_traffic[0]: Refreshing state... [id=enpcbac0585q1cchaonk]
module.kube.yandex_vpc_security_group_rule.k8s_node_ports[0]: Refreshing state... [id=enpv4rskkaipve0vl9de]
module.kube.time_sleep.wait_for_iam: Refreshing state... [id=2025-04-20T09:37:33Z]
module.kube.yandex_kubernetes_cluster.kube_cluster: Refreshing state... [id=catos66dnmadlbd2glcj]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.kube.yandex_kubernetes_cluster.kube_cluster has been deleted
  - resource "yandex_kubernetes_cluster" "kube_cluster" {
      - id                       = "catos66dnmadlbd2glcj" -> null
      - name                     = "k8s-cluster-7f46kpjf" -> null
        # (17 unchanged attributes hidden)

      - master {
          - cluster_ca_certificate = <<-EOT
                -----BEGIN CERTIFICATE-----
                MIIC5zCCAc+gAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
                cm5ldGVzMB4XDTI1MDQyMDA5MzczNloXDTM1MDQxODA5MzczNlowFTETMBEGA1UE
                AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAOt0
                KSMjW4STUeF8TBtNjeQHcFvIEhrExtesbcot7KVkPFRjHAGEkB64+r7+etU7uQgI
                5E8dq9CLQk1/zh2VCdKFp5lhTrr7Jeq8DCBa7NNQeeDeBgk49N5c4Ui+UEFzf9La
                tMsEGZQ6nIzTL+656u6yzloJ9AGUbFtvuSoDPi271qqlCfifjf0koq5iYKuv7ccG
                b4v7rkk7D7lRgEzt5LKYuOKs7K1NwZYi+ZNYpEu2y/Alr4ZRI0GEKM54nvkSFsB4
                2X7VQYmnv4SQgWGwoxl3h3jR58VmqBRRrBntt9p1YbGWUnocPuCQP+UwZnt+c4NU
                NE68Z0v30LiBksrZAekCAwEAAaNCMEAwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
                /wQFMAMBAf8wHQYDVR0OBBYEFAetdMKIu3Zpm56I0VJnPogz3nYVMA0GCSqGSIb3
                DQEBCwUAA4IBAQA7DkTw+ErBWhU39Ge7wegadaggPqKg8jCljM7FX6By8Tok9Xc9
                TpGtUENXDg71xpEMxIUGw8kkkYQwesR0BcmhemA4bqk0N+2hBn/RC4znOL5SJReo
                1SfTzqQKS5fjHsvSQ9PI/R+5c8lgFJcuMBmXMooSSwfP1m7s1bCCVJPUPIfE7HSG
                oXIocgVuqyYQglhiOjrFKKvHAoS86AySpt4eAVaWcBcgbykhSeW7jVupoa+Lvu1D
                TnxuVbzhYLf0duewZtfsWU+0ZfTxZlN//SGyHxcdalO+/JxgkQ8cT0q0MG+hBOxt
                rrw4j0jyAKFkvuy7EbdRpyGEpmZWemOHL3LN
                -----END CERTIFICATE-----
            EOT -> null
          - external_v4_address    = "158.160.89.162" -> null
          - external_v4_endpoint   = "https://158.160.89.162" -> null
          - internal_v4_address    = "10.10.0.34" -> null
          - internal_v4_endpoint   = "https://10.10.0.34" -> null
            # (7 unchanged attributes hidden)

            # (4 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube.yandex_kubernetes_cluster.kube_cluster will be created
  + resource "yandex_kubernetes_cluster" "kube_cluster" {
      + cluster_ipv4_range       = "172.17.0.0/16"
      + cluster_ipv6_range       = (known after apply)
      + created_at               = (known after apply)
      + description              = "Yandex Managed K8S cluster"
      + folder_id                = "b1gsjjo950i2c5fs82pe"
      + health                   = (known after apply)
      + id                       = (known after apply)
      + labels                   = (known after apply)
      + log_group_id             = (known after apply)
      + name                     = "k8s-cluster-7f46kpjf"
      + network_id               = "enpfvstgrpql3nm9ljha"
      + network_policy_provider  = "CALICO"
      + node_ipv4_cidr_mask_size = 24
      + node_service_account_id  = "aje7n2bce7r1d3hunl0p"
      + release_channel          = "REGULAR"
      + service_account_id       = "ajea8pbj4f601i56sm5u"
      + service_ipv4_range       = "172.18.0.0/16"
      + service_ipv6_range       = (known after apply)
      + status                   = (known after apply)

      + kms_provider {
          + key_id = "abjes6v5635sq3hrssui"
        }

      + master {
          + cluster_ca_certificate = (known after apply)
          + etcd_cluster_size      = (known after apply)
          + external_v4_address    = (known after apply)
          + external_v4_endpoint   = (known after apply)
          + external_v6_endpoint   = (known after apply)
          + internal_v4_address    = (known after apply)
          + internal_v4_endpoint   = (known after apply)
          + public_ip              = true
          + security_group_ids     = [
              + "enphhr50vgv3q3d6cu4t",
              + "enpmmfsa3fghjuaq0fi7",
            ]
          + version                = (known after apply)
          + version_info           = (known after apply)

          + maintenance_policy {
              + auto_upgrade = true

              + maintenance_window {
                  + day        = "monday"
                  + duration   = "3h"
                  + start_time = "23:00"
                }
            }

          + master_location {
              + subnet_id = "e2lgfldqt2831li63a77"
              + zone      = "ru-central1-b"
            }

          + master_logging {
              + audit_enabled              = true
              + cluster_autoscaler_enabled = true
              + enabled                    = true
              + events_enabled             = true
              + folder_id                  = "b1gsjjo950i2c5fs82pe"
              + kube_apiserver_enabled     = true
            }

          + regional (known after apply)

          + zonal (known after apply)
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }
    }

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 01"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-01"
      + node_labels       = {
          + "environment" = "testing"
          + "role"        = "worker-01"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy (known after apply)

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = [
                  + "enp4nj9j4iin76n4t30v",
                  + "enphhr50vgv3q3d6cu4t",
                ]
              + subnet_ids         = [
                  + "e2lgfldqt2831li63a77",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"] will be created
  + resource "yandex_kubernetes_node_group" "kube_node_groups" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = "Kubernetes nodes group 02"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "yc-k8s-ng-02"
      + node_labels       = {
          + "environment" = "dev"
          + "role"        = "worker-02"
        }
      + status            = (known after apply)
      + version           = (known after apply)
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-b"
            }
        }

      + deploy_policy {
          + max_expansion   = 1
          + max_unavailable = 1
        }

      + instance_template {
          + metadata                  = {
              + "enable-oslogin" = "false"
            }
          + name                      = "{instance_group.id}-{instance.short_id}"
          + nat                       = (known after apply)
          + network_acceleration_type = "standard"
          + platform_id               = "standard-v3"

          + boot_disk {
              + size = 64
              + type = "network-hdd"
            }

          + container_network (known after apply)

          + container_runtime {
              + type = "containerd"
            }

          + gpu_settings (known after apply)

          + network_interface {
              + ipv4               = true
              + ipv6               = false
              + nat                = false
              + security_group_ids = [
                  + "enp4nj9j4iin76n4t30v",
                  + "enphhr50vgv3q3d6cu4t",
                ]
              + subnet_ids         = [
                  + "e2lgfldqt2831li63a77",
                ]
            }

          + resources {
              + core_fraction = 50
              + cores         = 2
              + gpus          = 0
              + memory        = 2
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true

          + maintenance_window {
              + day        = "monday"
              + duration   = "3h"
              + start_time = "23:00"
            }
        }

      + scale_policy {
          + auto_scale {
              + initial = 0
              + max     = 1
              + min     = 0
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_ca_certificate = (sensitive value)
  ~ cluster_id             = "catos66dnmadlbd2glcj" -> (known after apply)
  ~ external_v4_endpoint   = (sensitive value)
module.kube.yandex_kubernetes_cluster.kube_cluster: Creating...
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [1m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [2m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [3m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [4m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [5m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m40s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [6m50s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [7m0s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [7m10s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [7m20s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Still creating... [7m30s elapsed]
module.kube.yandex_kubernetes_cluster.kube_cluster: Creation complete after 7m38s [id=catutmlbivnimqku4skn]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Creating...
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Creating...
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [10s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [10s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [20s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [20s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [30s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [30s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [40s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [40s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [50s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [50s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m0s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [1m0s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [1m10s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m10s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [1m20s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m20s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m30s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [1m30s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Still creating... [1m40s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m40s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-02"]: Creation complete after 1m49s [id=catsbqu3bmkjs9ikq8ln]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Still creating... [1m50s elapsed]
module.kube.yandex_kubernetes_node_group.kube_node_groups["yc-k8s-ng-01"]: Creation complete after 1m51s [id=cat7ekgq2sib0b72trjm]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

cluster_ca_certificate = <sensitive>
cluster_id = "catutmlbivnimqku4skn"
external_v4_endpoint = <sensitive>


```

</details>

Results for commit: 316aaf498984e84317800880f42e67a26c121e8d

*Pusher: @ptishkin, Action: `pull_request`, Working Directory: `kube`, Workflow: `Terraform CI/CD`*